//! Библиотека компилятора ZIP.

#[path = "лексика.rs"]
pub mod лексика;

#[path = "дерево.rs"]
pub mod дерево;

#[path = "парсер.rs"]
pub mod парсер;

#[path = "промежуток.rs"]
pub mod промежуток;

#[path = "нативный.rs"]
pub mod нативный;

pub use дерево::Узел;
pub use лексика::{Лексер, ОшибкаЛексики, ПозиционныйТокен, Токен};
pub use парсер::{разобрать_исходник, ОшибкаПарсера, Парсер};
pub use промежуток::{сгенерировать_из_исходника, ГенераторПП, Инструкция, ФункцияПП};
pub use нативный::{скомпилировать_в_ассемблер, ГенераторНативногоКода};
